Revit 2024 API
BuiltInFailures.StairRampFailures.CannotGenerateRamp Property
 Couldn't generate surfaces for ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotGenerateRamp { get; }
Visual Basic
Public Shared ReadOnly Property CannotGenerateRamp As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotGenerateRamp {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace